In [ ]:
!pip install ipython-sql

In [15]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql

CREATE TABLE footbal_legends (
    ID INTEGER,
    Name TEXT,
    Age INTEGER,
  	Club TEXT,
  	League TEXT,
  	Period Integer
);

In [17]:
%%sql

INSERT INTO footbal_legends(ID, Name, Age, Club, League, Period)
VALUES (1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1);
INSERT INTO footbal_legends(ID, Name, Age, Club, League, Period)
VALUES (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1);
INSERT INTO footbal_legends(ID, Name, Age, Club, League, Period)
VALUES (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7);
INSERT INTO footbal_legends(ID, Name, Age, Club, League, Period)
VALUES (4, 'Anthony Martial', 28, 'Manchester United', 'EPL', 5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [18]:
%%sql

SELECT *
FROM footbal_legends

 * sqlite://
Done.

[(1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1, None),
 (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1, None),
 (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7, None),
 (1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1, None),
 (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1, None),
 (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7, None),
 (4, 'Anthony Martial', 28, 'Manchester United', 'EPL', 5, None)]

In [19]:
%%sql

ALTER TABLE footbal_legends
ADD COLUMN Nationality TEXT;

 * sqlite://
(sqlite3.OperationalError) duplicate column name: Nationality
[SQL: ALTER TABLE footbal_legends
ADD COLUMN Nationality TEXT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [20]:
%%sql

UPDATE footbal_legends
	SET
    	Nationality = 'Argentina'
    WHERE
    	ID = 1
UPDATE footbal_legends
	SET
    	Nationality = 'Senegal'
    WHERE
    	ID = 2
UPDATE footbal_legends
	SET
    	Nationality = 'Branzil'
    WHERE
    	ID = 3
 UPDATE footbal_legends
	SET
    	Nationality = 'France'
    WHERE
    	ID = 4

 * sqlite://
(sqlite3.OperationalError) near "UPDATE": syntax error
[SQL: UPDATE footbal_legends
	SET
    	Nationality = 'Argentina'
    WHERE
    	ID = 1
UPDATE footbal_legends
	SET
    	Nationality = 'Senegal'
    WHERE
    	ID = 2
UPDATE footbal_legends
	SET
    	Nationality = 'Branzil'
    WHERE
    	ID = 3
 UPDATE footbal_legends
	SET
    	Nationality = 'France'
    WHERE
    	ID = 4]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [21]:
%%sql

SELECT *
FROM footbal_legends

 * sqlite://
Done.

[(1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1, None),
 (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1, None),
 (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7, None),
 (1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1, None),
 (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1, None),
 (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7, None),
 (4, 'Anthony Martial', 28, 'Manchester United', 'EPL', 5, None)]

In [22]:
%%sql

DELETE FROM footbal_legends
WHERE ID = 4;

 * sqlite://
1 rows affected.

[]

In [23]:
%%sql

SELECT *
FROM footbal_legends;

 * sqlite://
Done.

[(1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1, None),
 (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1, None),
 (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7, None),
 (1, 'Lionel Messi', 36, 'Inter-Miami', 'MLS', 1, None),
 (2, 'Sadio Mane', 31, 'AI-NSSR', 'Saudi Pro League', 1, None),
 (3, 'Thiago Silver', 37, 'Chelsea', 'EPL', 7, None)]